DoS Testmessages/Axis2-Sign_allowedInjectionPlaces.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:axis="http://axis21.kmzs.ba" $$PAYLOADATTR$$>
   <soap:Header $$PAYLOADATTR$$><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" $$PAYLOADATTR$$><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#" Id="SIG-AC5903F7D6DFBD4BC1147436375043214"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces PrefixList="axis soap" xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:CanonicalizationMethod><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><ds:Reference URI="#id-AC5903F7D6DFBD4BC1147436375043113"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces PrefixList="axis" xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>xE51Y6oGuUETiG/3Any71ug5OVo=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>PjluRHa66MEsNAAi0NFBVjT1sJv+YTzZcpjnsiPW5/apLSPJQ7zCEaTS+ksgf9xFbNP+SV21VBrLqIMtw1ErSTbKtOYMSIWTGnuP44Q+NkcZkm7a9tDMZqv6bUMneGDc36WG3uCb8j4vMcKcQQvdpjI5Pk793KT4XeevSWh+S316sX2KuP32YVTRKtPdgkTfzA5pNRS4payb+TJ9C5rDY6slv3frS7gMvRvFVA5fslj+pHy4yctDNortLYxyyOZb5MgaHuw86vYgD11ug2z1t40p89HQbf5Qe8VabJtQi2AixR5frG2EQjZ+L+N3U56ZH80g3oWySvdPHcsi4qn+Kw==</ds:SignatureValue><ds:KeyInfo Id="KI-AC5903F7D6DFBD4BC1147436375043011" $$PAYLOADATTR$$><wsse:SecurityTokenReference $$PAYLOADATTR$$ wsu:Id="STR-AC5903F7D6DFBD4BC1147436375043012"><ds:X509Data $$PAYLOADATTR$$><ds:X509IssuerSerial><ds:X509IssuerName>CN=client</ds:X509IssuerName><ds:X509SerialNumber>1034513739</ds:X509SerialNumber></ds:X509IssuerSerial>$$PAYLOADELEMENT$$</ds:X509Data></wsse:SecurityTokenReference></ds:KeyInfo><ds:Object $$PAYLOADATTR$$>$$PAYLOADELEMENT$$</ds:Object></ds:Signature>$$PAYLOADELEMENT$$</wsse:Security>$$PAYLOADELEMENT$$</soap:Header>
   <soap:Body wsu:Id="id-AC5903F7D6DFBD4BC1147436375043113" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
      <axis:getAdminToken/>
   </soap:Body>
</soap:Envelope>